Revit 2027 API
ViewSchedule.TitleTextTypeId Property
 Defines the default text style used in the header section of the schedule.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId TitleTextTypeId { get; set; }
Public Property TitleTextTypeId As ElementId
	Get
	Set
public:
property ElementId^ TitleTextTypeId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member TitleTextTypeId : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The text type id doesn't represent a valid text type element.
ArgumentNullException |  When setting this property: A non-optional argument was null
Remarks
 Cells may override the default style.
See Also
Reference
ViewSchedule Class
Autodesk.Revit.DB Namespace